markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_client.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "pb_remote_client.h"
#include "pb_remote.h"
#include "pb_remote_msgs.h"

#include <stdint.h>
#include <stddef.h>

#include "nrf_error.h"

#include "nrf_mesh.h"
#include "nrf_mesh_assert.h"
#include "nrf_mesh_prov.h"
#include "prov_provisioner.h"
#include "prov_pdu.h"

#include "fifo.h"
#include "log.h"

#include "access.h"
#include "access_config.h"
#include "access_reliable.h"


/*****************************************************************************
 * Static asserts
 *****************************************************************************/

NRF_MESH_STATIC_ASSERT(PB_REMOTE_REPORT_STATUS_ACCEPTED                        <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_REPORT_STATUS_REJECTED                        <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_SCAN_STATUS_STARTED                           <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_SCAN_STATUS_CANCELED                          <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_SCAN_STATUS_CANNOT_START_SCANNING             <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_SCAN_STATUS_CANNOT_CANCEL_SCANNING            <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_SCAN_STATUS_ACCEPTED                          <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_SCAN_STATUS_REJECTED                          <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_REMOTE_LINK_STATUS_OPENING                    <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_REMOTE_LINK_STATUS_ALREADY_OPEN               <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_REMOTE_LINK_STATUS_CANNOT_CLOSE               <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_REMOTE_LINK_STATUS_LINK_NOT_ACTIVE            <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_REMOTE_LINK_STATUS_INVALID_UNPROV_DEVICE_ID   <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_REMOTE_LINK_STATUS_ACCEPTED                   <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_REMOTE_LINK_STATUS_REJECTED                   <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_LINK_STATUS_REPORT_OPENED                     <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_LINK_STATUS_REPORT_OPEN_TIMEOUT               <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_LINK_STATUS_REPORT_CLOSED                     <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_LINK_STATUS_REPORT_CLOSED_BY_DEVICE           <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_LINK_STATUS_REPORT_CLOSED_BY_SERVER           <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_PACKET_TRANSFER_DELIVERY_STATUS_DELIVERED     <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_PACKET_TRANSFER_DELIVERY_STATUS_NOT_DELIVERED <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_PACKET_TRANSFER_STATUS_BUFFER_ACCEPTED        <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_PACKET_TRANSFER_STATUS_LINK_NOT_ACTIVE        <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_PACKET_TRANSFER_STATUS_CANNOT_ACCEPT_BUFFER   <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_PACKET_TRANSFER_STATUS_ACCEPTED               <= UINT8_MAX);
NRF_MESH_STATIC_ASSERT(PB_REMOTE_PACKET_TRANSFER_STATUS_REJECTED               <= UINT8_MAX);

/*****************************************************************************
 * Definitions
 *****************************************************************************/

#define PB_REMOTE_CLIENT_EVENT_QUEUE_SIZE (2)

typedef enum
{
    PB_REMOTE_CLIENT_EVENT_UNPROV_UUID,
    PB_REMOTE_CLIENT_EVENT_UNPROV_NUMBER,
    PB_REMOTE_CLIENT_EVENT_SCAN_START,
    PB_REMOTE_CLIENT_EVENT_SCAN_CANCEL,
    PB_REMOTE_CLIENT_EVENT_SCAN_STATUS,
    PB_REMOTE_CLIENT_EVENT_LINK_STATUS,
    PB_REMOTE_CLIENT_EVENT_LINK_STATUS_REPORT,
    PB_REMOTE_CLIENT_EVENT_LINK_CLOSE,
    PB_REMOTE_CLIENT_EVENT_PACKET_TRANSFER,
    PB_REMOTE_CLIENT_EVENT_TRANSFER_STATUS,
    PB_REMOTE_CLIENT_EVENT_TRANSFER_STATUS_REPORT,
    PB_REMOTE_CLIENT_EVENT_PROV_START,
    PB_REMOTE_CLIENT_EVENT_LOCAL_PACKET,
    PB_REMOTE_CLIENT_EVENT_TX_FAILED,
    PB_REMOTE_CLIENT_EVENT_LAST       /**< Used to set the size of the event handler list. */
} pb_remote_client_event_type_t;

typedef struct
{
    uint16_t length;
    uint8_t payload[PROV_PDU_MAX_LENGTH];
} pb_remote_event_pb_adv_pdu_t;

typedef struct
{
    uint8_t unprov_device_id;
    const nrf_mesh_prov_provisioning_data_t * p_prov_data;
} pb_remote_event_prov_start_t;

typedef struct
{
    pb_remote_client_event_type_t type;
    union
    {
        pb_remote_event_pb_adv_pdu_t pb_adv_pdu;
        const access_message_rx_t * p_message;
        nrf_mesh_prov_link_close_reason_t link_close_reason;
        pb_remote_event_prov_start_t prov_start;

    } evt;
} pb_remote_client_event_t;

typedef pb_remote_client_state_t (*pb_remote_client_event_handler_cb_t)(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);

