markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_client.c
/*******************************************************************************
 * Static variables
 *******************************************************************************/

static void remote_client_access_rx_cb(access_model_handle_t model_handle, const access_message_rx_t * p_message, void * p_args);

/* TODO: If possible, the each of the opcodes should be handled in their event callback directly,
 * but that would require a bigger re-work of the design. */
static const access_opcode_handler_t m_opcode_handlers[] =
{
    {{PB_REMOTE_OP_SCAN_UUID_REPORT,        ACCESS_COMPANY_ID_NONE}, remote_client_access_rx_cb},
    {{PB_REMOTE_OP_SCAN_STATUS,             ACCESS_COMPANY_ID_NONE}, remote_client_access_rx_cb},
    {{PB_REMOTE_OP_LINK_STATUS,             ACCESS_COMPANY_ID_NONE}, remote_client_access_rx_cb},
    {{PB_REMOTE_OP_LINK_STATUS_REPORT,      ACCESS_COMPANY_ID_NONE}, remote_client_access_rx_cb},
    {{PB_REMOTE_OP_PACKET_TRANSFER,         ACCESS_COMPANY_ID_NONE}, remote_client_access_rx_cb},
    {{PB_REMOTE_OP_PACKET_TRANSFER_REPORT,  ACCESS_COMPANY_ID_NONE}, remote_client_access_rx_cb},
    {{PB_REMOTE_OP_PACKET_TRANSFER_STATUS,  ACCESS_COMPANY_ID_NONE}, remote_client_access_rx_cb}
};

/* Forward declarations */
static pb_remote_client_state_t pb_remote_client_event_unprov_uuid_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_unprov_number_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_scan_start_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_scan_cancel_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_scan_status_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_link_status_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_link_status_report_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_link_close_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_packet_transfer_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_transfer_status_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_transfer_status_report_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_prov_start_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_local_packet_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);
static pb_remote_client_state_t pb_remote_client_event_tx_failed_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt);

const pb_remote_client_event_handler_cb_t
m_pb_remote_client_event_handler_callbacks[PB_REMOTE_CLIENT_EVENT_LAST] =
{
    pb_remote_client_event_unprov_uuid_cb,
    pb_remote_client_event_unprov_number_cb,
    pb_remote_client_event_scan_start_cb,
    pb_remote_client_event_scan_cancel_cb,
    pb_remote_client_event_scan_status_cb,
    pb_remote_client_event_link_status_cb,
    pb_remote_client_event_link_status_report_cb,
    pb_remote_client_event_link_close_cb,
    pb_remote_client_event_packet_transfer_cb,
    pb_remote_client_event_transfer_status_cb,
    pb_remote_client_event_transfer_status_report_cb,
    pb_remote_client_event_prov_start_cb,
    pb_remote_client_event_local_packet_cb,
    pb_remote_client_event_tx_failed_cb
};

static pb_remote_client_t * mp_pb_remote_client_model;

/** Buffer for storing reliable packet. */
static union
{
    pb_remote_packet_t packet;
    uint8_t buffer[PROV_PDU_MAX_LENGTH];
} m_packet;

static pb_remote_client_event_t m_pbr_client_event_queue_buffer[PB_REMOTE_CLIENT_EVENT_QUEUE_SIZE];
static fifo_t m_pbr_client_event_queue;

static bool m_is_interrupting;

static uint32_t pb_if_tx_cb(prov_bearer_t * p_bearer, const uint8_t * p_data, uint16_t length);
static void pb_if_link_close_cb(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason);
static uint32_t pb_if_link_open_cb(prov_bearer_t * p_bearer, const uint8_t * p_uuid, uint32_t link_timeout_us);
static uint32_t pb_if_listen_start_cb(prov_bearer_t * p_bearer, const char * p_uri, uint16_t oob_info, uint32_t link_timeout_us);
static uint32_t pb_if_listen_stop_cb(prov_bearer_t * p_bearer);

const prov_bearer_interface_t m_prov_interface =
{
    .tx           = pb_if_tx_cb,
    .listen_start = pb_if_listen_start_cb,
    .listen_stop  = pb_if_listen_stop_cb,
    .link_open    = pb_if_link_open_cb,
    .link_close   = pb_if_link_close_cb
};

static void pb_remote_client_process(pb_remote_client_t * p_ctx);

/*******************************************************************************
 * Static functions
 *******************************************************************************/

static inline prov_bearer_t * bearer_ctx_get(nrf_mesh_prov_ctx_t * p_ctx)
{
    return &(((prov_common_ctx_t*) p_ctx)->bearer);
}

static void client_reliable_status_cb(access_model_handle_t model_handle, void * p_args, access_reliable_status_t status)
{
    NRF_MESH_ASSERT(NULL != p_args);
    pb_remote_client_t * p_self = p_args;

    switch (status)
    {
        case ACCESS_RELIABLE_TRANSFER_SUCCESS:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Got ACK for [aop: 0x%04x]", p_self->reliable.message.opcode.opcode);
            break;


        case ACCESS_RELIABLE_TRANSFER_TIMEOUT:
        {
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Unable to send message [aop: 0x%04x]", p_self->reliable.message.opcode.opcode);
            pb_remote_client_event_t event = {.type = PB_REMOTE_CLIENT_EVENT_TX_FAILED};
            NRF_MESH_ASSERT(fifo_push(&m_pbr_client_event_queue, &event) == NRF_SUCCESS);
            pb_remote_client_process(p_self);
            break;
        }
        default:
            NRF_MESH_ASSERT(false);
            break;
    }

