markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_client.c
}

static void status_event_push(pb_remote_client_t * p_ctx, pb_remote_event_type_t status_event_type)
{
    pb_remote_event_t event = {.type = status_event_type};
    p_ctx->event_cb(&event);
}

static inline void send_reliable_msg(pb_remote_client_t * p_ctx, pb_remote_opcode_t opcode, pb_remote_opcode_t reply_opcode, uint16_t length)
{
    p_ctx->reliable.message.opcode.opcode = opcode;
    p_ctx->reliable.message.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    p_ctx->reliable.message.p_buffer = m_packet.buffer;
    p_ctx->reliable.message.length = length;
    p_ctx->reliable.reply_opcode.opcode = reply_opcode;
    p_ctx->reliable.reply_opcode.company_id = ACCESS_COMPANY_ID_NONE;
    NRF_MESH_ERROR_CHECK(access_model_reliable_publish(&p_ctx->reliable));
}

static inline void send_reply(const pb_remote_client_t * p_ctx, const access_message_rx_t * p_rx_msg, const access_message_tx_t * p_reply)
{
    uint32_t status = access_model_reply(p_ctx->model_handle, p_rx_msg, p_reply);
    NRF_MESH_ASSERT(NRF_SUCCESS == status || NRF_ERROR_NO_MEM == status);
}

static pb_remote_client_state_t pb_remote_client_event_tx_failed_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK:
            /* We couldn't send the reliable message, no point in trying to close link or whatever,
             * since the message won't get through. */
            status_event_push(p_ctx, PB_REMOTE_EVENT_TX_FAILED);
            if (p_ctx->reliable.reply_opcode.opcode != PB_REMOTE_OP_SCAN_STATUS)
            {
                /* Push a link closed message if we were waiting for something else than a SCAN_STATUS. */
                prov_cb_link_closed(bearer_ctx_get(p_ctx->p_prov_ctx),
                                    NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
                status_event_push(p_ctx, PB_REMOTE_EVENT_LINK_CLOSED);
            }
            return PB_REMOTE_CLIENT_STATE_IDLE;

        default:
            /* We should not be getting this event in any other state(s). */
            NRF_MESH_ASSERT(false);
            return PB_REMOTE_CLIENT_STATE_IDLE;
    }
}

static pb_remote_client_state_t pb_remote_client_event_unprov_uuid_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    pb_remote_msg_scan_report_status_t scan_report_status;
    access_message_tx_t reply;
    reply.opcode.opcode = PB_REMOTE_OP_SCAN_REPORT_STATUS;
    reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    reply.p_buffer = (const uint8_t*) &scan_report_status;
    reply.length = sizeof(scan_report_status);

    pb_remote_msg_scan_uuid_report_t * p_scan_report =
        (pb_remote_msg_scan_uuid_report_t *) &p_evt->evt.p_message->p_data[0];

    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_IDLE:
        {

            scan_report_status.status = PB_REMOTE_REPORT_STATUS_ACCEPTED;
            scan_report_status.unprov_device_id = p_scan_report->unprov_device_id;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);

            pb_remote_event_t event;
            event.type = PB_REMOTE_EVENT_REMOTE_UUID;
            event.remote_uuid.p_uuid = p_scan_report->uuid;
            event.remote_uuid.device_id = p_scan_report->unprov_device_id;
            p_ctx->event_cb(&event);

            return p_ctx->state;
        }
        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_INFO, "Unexpected UUID report in state %u\n", p_ctx->state);
            scan_report_status.status = PB_REMOTE_REPORT_STATUS_REJECTED;
            scan_report_status.unprov_device_id = p_scan_report->unprov_device_id;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_unprov_number_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    /** @todo Support the unprov_number feature. */
    switch (p_ctx->state)
    {
        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Unexpected UUID number report in state %u\n", p_ctx->state);
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_scan_start_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_IDLE:
            send_reliable_msg(p_ctx, PB_REMOTE_OP_SCAN_START, PB_REMOTE_OP_SCAN_STATUS, 0);
            return PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK;

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got scan start in state %u.\n", p_ctx->state);
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_scan_cancel_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{

    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_IDLE:
            send_reliable_msg(p_ctx, PB_REMOTE_OP_SCAN_CANCEL, PB_REMOTE_OP_SCAN_STATUS, 0);
            return PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK;

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got scan cancel in state %u.\n", p_ctx->state);
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_scan_status_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    pb_remote_msg_scan_status_t * p_msg = (pb_remote_msg_scan_status_t *) &p_evt->evt.p_message->p_data[0];
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK:
        {
            if (p_ctx->reliable.reply_opcode.opcode == PB_REMOTE_OP_SCAN_STATUS)
            {
                switch (p_msg->status)
                {
                    case PB_REMOTE_SCAN_STATUS_STARTED:
                        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "The Server started the scanning.\n");
                        status_event_push(p_ctx, PB_REMOTE_EVENT_SCAN_STARTED);
                        return PB_REMOTE_CLIENT_STATE_IDLE;

                    case PB_REMOTE_SCAN_STATUS_CANCELED:
                        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "The Server cancelled the scanning.\n");
                        status_event_push(p_ctx, PB_REMOTE_EVENT_SCAN_CANCELED);
                        return PB_REMOTE_CLIENT_STATE_IDLE;


                    case PB_REMOTE_SCAN_STATUS_CANNOT_START_SCANNING:
                    {
                        status_event_push(p_ctx, PB_REMOTE_EVENT_CANNOT_START_SCANNING);
                        return PB_REMOTE_CLIENT_STATE_IDLE;
                    }
                    case PB_REMOTE_SCAN_STATUS_CANNOT_CANCEL_SCANNING:
                    {
                        status_event_push(p_ctx, PB_REMOTE_EVENT_CANNOT_CANCEL_SCANNING);
                        return PB_REMOTE_CLIENT_STATE_IDLE;
                    }
                    default:
                        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Unexpected scan status %u.\n", p_msg->status);
                        return PB_REMOTE_CLIENT_STATE_IDLE;
                }
            }
            else
            {
                return p_ctx->state;
            }
        }
        default:
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_link_status_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    pb_remote_msg_link_status_t * p_link_msg = (pb_remote_msg_link_status_t *) &p_evt->evt.p_message->p_data[0];
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_IDLE:
            switch (p_link_msg->status)
            {
                case PB_REMOTE_REMOTE_LINK_STATUS_OPENING:
                    __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Remote is opening link.\n");
                    return PB_REMOTE_CLIENT_STATE_IDLE;

                case PB_REMOTE_REMOTE_LINK_STATUS_ALREADY_OPEN:
                    __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Link already open.\n");
                    return PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED;

                default:
                    __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Got link status %u.\n", p_link_msg->status);
                    return p_ctx->state;
            }

        case PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED:
            /* If we are in LINK_ESTABLISHED, is there any scenario where we would receive a
             * link status? */
            return p_ctx->state;

