markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_client.c
        case PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK:

            /* Are we waiting for a link status? */
            if (p_ctx->reliable.reply_opcode.opcode == PB_REMOTE_OP_LINK_STATUS)
            {
                switch (p_link_msg->status)
                {
                    case PB_REMOTE_REMOTE_LINK_STATUS_OPENING:
                        return PB_REMOTE_CLIENT_STATE_IDLE;

                    case PB_REMOTE_REMOTE_LINK_STATUS_ALREADY_OPEN:
                        status_event_push(p_ctx, PB_REMOTE_EVENT_LINK_ALREADY_OPEN);
                        return PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED;

                    case PB_REMOTE_REMOTE_LINK_STATUS_CANNOT_CLOSE:
                        status_event_push(p_ctx, PB_REMOTE_EVENT_CANNOT_CLOSE_LINK);
                        return PB_REMOTE_CLIENT_STATE_IDLE;

                    case PB_REMOTE_REMOTE_LINK_STATUS_LINK_NOT_ACTIVE:
                        status_event_push(p_ctx, PB_REMOTE_EVENT_LINK_NOT_ACTIVE);
                        return PB_REMOTE_CLIENT_STATE_IDLE;

                    case PB_REMOTE_REMOTE_LINK_STATUS_INVALID_UNPROV_DEVICE_ID:
                        status_event_push(p_ctx, PB_REMOTE_EVENT_INVALID_UNPROV_DEVICE_ID);
                        return PB_REMOTE_CLIENT_STATE_IDLE;

                    case PB_REMOTE_REMOTE_LINK_STATUS_ACCEPTED:
                        /* The server accepted the close => Wait for the link status report. */
                        return PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED;

                    default:
                        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_INFO, "Got unexpected link status %u.\n", p_link_msg->status);
                        return PB_REMOTE_CLIENT_STATE_IDLE;
                }
            }
            else
            {
                return p_ctx->state;
            }



        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_INFO, "Got link status %u.\n", p_link_msg->status);
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_link_status_report_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    pb_remote_msg_link_status_report_t * p_link_msg = (pb_remote_msg_link_status_report_t *) &p_evt->evt.p_message->p_data[0];

    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK:
            /* The incoming message is either reporting a PB_REMOTE_LINK_STATUS_REPORT_OPENED (1)
             * or a PB_REMOTE_LINK_STATUS_REPORT_CLOSED (2) status.
             *
             * (1) The first case would be that we missed the PB_REMOTE_OP_LINK_STATUS ACK for our
             * PB_REMOTE_OP_LINK_OPEN command and the server is notifying the client about the new
             * link status.
             * (2) The second case is that the remote local link closed for some reason and we need
             * to handle that.
             *
             * In either case, we should abort what we're doing and handle the link status change.
             */
            NRF_MESH_ASSERT(access_model_reliable_cancel(p_ctx->model_handle) == NRF_SUCCESS);
            /* fall-through */
        case PB_REMOTE_CLIENT_STATE_IDLE:
        case PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED:
        {
            pb_remote_msg_link_status_t link_status;
            access_message_tx_t reply;
            reply.opcode.opcode = PB_REMOTE_OP_LINK_STATUS;
            reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
            reply.p_buffer = (const uint8_t *) &link_status;
            reply.length = sizeof(link_status);

            link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_ACCEPTED;
            link_status.bearer_type = NRF_MESH_PROV_BEARER_ADV;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);

            switch (p_link_msg->status)
            {
                case PB_REMOTE_LINK_STATUS_REPORT_OPEN_TIMEOUT:
                    status_event_push(p_ctx, PB_REMOTE_EVENT_CANNOT_OPEN_LINK);
                    /* fall through */
                case PB_REMOTE_LINK_STATUS_REPORT_CLOSED_BY_DEVICE:
                case PB_REMOTE_LINK_STATUS_REPORT_CLOSED:
                case PB_REMOTE_LINK_STATUS_REPORT_CLOSED_BY_SERVER:
                    prov_cb_link_closed(bearer_ctx_get(p_ctx->p_prov_ctx),
                                        (nrf_mesh_prov_link_close_reason_t) p_link_msg->reason);
                    status_event_push(p_ctx, PB_REMOTE_EVENT_LINK_CLOSED);
                    return PB_REMOTE_CLIENT_STATE_IDLE;

                case PB_REMOTE_LINK_STATUS_REPORT_OPENED:
                    prov_cb_link_opened(bearer_ctx_get(p_ctx->p_prov_ctx));
                    return PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED;

                default:
                    prov_cb_link_closed(bearer_ctx_get(p_ctx->p_prov_ctx),
                                        NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
                    status_event_push(p_ctx, PB_REMOTE_EVENT_LINK_CLOSED);
                    __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Unexpected status %u in state %u.\n", p_link_msg->status, p_ctx->state);
                    return PB_REMOTE_CLIENT_STATE_IDLE;
            }
        }

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got unexpected link status %u in state %u.\n", p_link_msg->status, p_ctx->state);
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_link_close_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED:
        {
            m_packet.packet.link_close.reason = p_evt->evt.link_close_reason;
            send_reliable_msg(p_ctx,
                              PB_REMOTE_OP_LINK_CLOSE,
                              PB_REMOTE_OP_LINK_STATUS,
                              sizeof(pb_remote_msg_link_close_t));
            return PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK;
        }

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Unexpected LINK_CLOSE event in state %u.\n", p_ctx->state);
            return PB_REMOTE_CLIENT_STATE_IDLE;
    }
}

