markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_client.c
static pb_remote_client_state_t pb_remote_client_event_packet_transfer_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    pb_remote_msg_packet_transfer_status_t transfer_status;
    access_message_tx_t reply;
    reply.opcode.opcode = PB_REMOTE_OP_PACKET_TRANSFER_STATUS;
    reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    reply.p_buffer = (const uint8_t *) &transfer_status;
    reply.length = sizeof(transfer_status);

    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK:
            /* We do not allow two consecutive packet transfers. Assume the last ACK was lost. */
            transfer_status.status = PB_REMOTE_PACKET_TRANSFER_STATUS_BUFFER_ACCEPTED;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return p_ctx->state;

        case PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED:
        {
            pb_remote_packet_t * p_pb_remote_packet = (pb_remote_packet_t *) &p_evt->evt.p_message->p_data[0];

            /** @todo Check length against provisioning PDUs? */

            transfer_status.status = PB_REMOTE_PACKET_TRANSFER_STATUS_BUFFER_ACCEPTED;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            prov_cb_pkt_in(bearer_ctx_get(p_ctx->p_prov_ctx),
                           &p_pb_remote_packet->packet_transfer.buffer[0],
                           p_evt->evt.p_message->length);
            return PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED;
        }

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got unexpected packet transfer in state %u.\n", p_ctx->state);
            transfer_status.status = PB_REMOTE_PACKET_TRANSFER_STATUS_LINK_NOT_ACTIVE;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_transfer_status_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    pb_remote_msg_packet_transfer_status_t * p_msg = (pb_remote_msg_packet_transfer_status_t *) &p_evt->evt.p_message->p_data[0];
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK:
            if (p_ctx->reliable.reply_opcode.opcode == PB_REMOTE_OP_PACKET_TRANSFER_STATUS)
            {
                switch (p_msg->status)
                {
                    case PB_REMOTE_PACKET_TRANSFER_STATUS_BUFFER_ACCEPTED:
                        return PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED;

                    case PB_REMOTE_PACKET_TRANSFER_STATUS_LINK_NOT_ACTIVE:
                    case PB_REMOTE_PACKET_TRANSFER_STATUS_CANNOT_ACCEPT_BUFFER:
                    default:
                        prov_cb_link_closed(bearer_ctx_get(p_ctx->p_prov_ctx),
                                            NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
                        status_event_push(p_ctx, PB_REMOTE_EVENT_LINK_CLOSED);
                        return PB_REMOTE_CLIENT_STATE_IDLE;
                }
            }
            else
            {
                return p_ctx->state;
            }

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_INFO, "Got transfer status %u in state %u.\n", p_msg->status, p_ctx->state);
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_transfer_status_report_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK:
            if (p_ctx->reliable.reply_opcode.opcode != PB_REMOTE_OP_PACKET_TRANSFER_STATUS)
            {
                return p_ctx->state;
            }

            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Implicit ack\n");
            NRF_MESH_ASSERT(access_model_reliable_cancel(p_ctx->model_handle) == NRF_SUCCESS);
            /* fall-through */
        case PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED:
        {
            pb_remote_msg_packet_transfer_report_t * p_pkt = (pb_remote_msg_packet_transfer_report_t *) &p_evt->evt.p_message->p_data[0];
            if (p_pkt->status == PB_REMOTE_PACKET_TRANSFER_DELIVERY_STATUS_DELIVERED)
            {
                pb_remote_msg_packet_transfer_status_t transfer_status;
                access_message_tx_t reply;
                reply.opcode.opcode = PB_REMOTE_OP_PACKET_TRANSFER_STATUS;
                reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
                reply.p_buffer = (const uint8_t *) &transfer_status;
                reply.length = sizeof(transfer_status);
                transfer_status.status = PB_REMOTE_PACKET_TRANSFER_STATUS_ACCEPTED;
                send_reply(p_ctx, p_evt->evt.p_message, &reply);

                prov_cb_ack_in(bearer_ctx_get(p_ctx->p_prov_ctx));
                return PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED;
            }
            else
            {
                m_packet.packet.link_close.reason = p_evt->evt.link_close_reason;
                send_reliable_msg(p_ctx, PB_REMOTE_OP_LINK_CLOSE, PB_REMOTE_OP_LINK_STATUS, sizeof(pb_remote_msg_link_close_t));
                return PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK;
            }
        }
        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got unknown message while waiting for packet ack.\n");
            return p_ctx->state;
    }
}

static pb_remote_client_state_t pb_remote_client_event_prov_start_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_IDLE:
        {
            NRF_MESH_ASSERT(prov_provisioner_provision((prov_common_ctx_t*) p_ctx->p_prov_ctx,
                                                       &m_prov_interface,
                                                       NULL,
                                                       p_evt->evt.prov_start.p_prov_data) == NRF_SUCCESS);

            m_packet.packet.link_open.unprov_device_id = p_evt->evt.prov_start.unprov_device_id;
            send_reliable_msg(p_ctx, PB_REMOTE_OP_LINK_OPEN, PB_REMOTE_OP_LINK_STATUS, sizeof(pb_remote_msg_link_open_t));
            return PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK;
        }

        default:
            /* Should not be possible to get this event in any other state. */
            NRF_MESH_ASSERT(false);
            return p_ctx->state;
    }
}

