markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_client.c
static pb_remote_client_state_t pb_remote_client_event_local_packet_cb(pb_remote_client_t * p_ctx, pb_remote_client_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_CLIENT_STATE_LINK_ESTABLISHED:
            NRF_MESH_ASSERT(p_evt->evt.pb_adv_pdu.length <= PROV_PDU_MAX_LENGTH);

            memcpy(&m_packet.packet.packet_transfer.buffer[0],
                   &p_evt->evt.pb_adv_pdu.payload[0],
                   p_evt->evt.pb_adv_pdu.length);

            send_reliable_msg(p_ctx, PB_REMOTE_OP_PACKET_TRANSFER, PB_REMOTE_OP_PACKET_TRANSFER_STATUS, p_evt->evt.pb_adv_pdu.length);

            return PB_REMOTE_CLIENT_STATE_WAIT_FOR_ACK;

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got packet_in in state %u.\n", p_ctx->state);
            return p_ctx->state;
    }
}

static void pb_remote_client_process(pb_remote_client_t * p_ctx)
{
    if (m_is_interrupting)
    {
        /* Event is queued. */
        return;
    }
    m_is_interrupting = true;

    pb_remote_client_event_t evt;
    while (fifo_pop(&m_pbr_client_event_queue, &evt) == NRF_SUCCESS)
    {
#if PB_REMOTE_DEBUG_VERBOSE
        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "CEvent: \"%s\"\n", evt_str[evt.type]);
#else
        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "CEvent: %u\n", evt.type);
#endif

        pb_remote_client_state_t next_state = m_pb_remote_client_event_handler_callbacks[evt.type](p_ctx, &evt);

        if (next_state != p_ctx->state)
        {
#if PB_REMOTE_DEBUG_VERBOSE
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Client: \"%s\" -> \"%s\".\n", state_str[p_ctx->state], state_str[next_state]);
#else
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Client: \"%u\" -> \"%u\".\n", p_ctx->state, next_state);
#endif

            p_ctx->state = next_state;
        }
    }

    m_is_interrupting = false;
}


static bool is_valid_message(const access_message_rx_t * p_message, pb_remote_client_event_type_t * p_evt_type)
{
    const struct
    {
        uint16_t opcode;
        uint16_t length;
        pb_remote_client_event_type_t event_type;
    } message_length_LUT[7] =
          {{PB_REMOTE_OP_SCAN_UUID_REPORT,        sizeof(pb_remote_msg_scan_uuid_report_t),                 PB_REMOTE_CLIENT_EVENT_UNPROV_UUID},
           {PB_REMOTE_OP_SCAN_UUID_NUMBER_REPORT, sizeof(pb_remote_msg_scan_unprov_device_number_report_t), PB_REMOTE_CLIENT_EVENT_UNPROV_NUMBER},
           {PB_REMOTE_OP_SCAN_STATUS,             sizeof(pb_remote_msg_scan_status_t),                      PB_REMOTE_CLIENT_EVENT_SCAN_STATUS},
           {PB_REMOTE_OP_LINK_STATUS,             sizeof(pb_remote_msg_link_status_t),                      PB_REMOTE_CLIENT_EVENT_LINK_STATUS},
           {PB_REMOTE_OP_LINK_STATUS_REPORT,      sizeof(pb_remote_msg_link_status_report_t),               PB_REMOTE_CLIENT_EVENT_LINK_STATUS_REPORT},
           {PB_REMOTE_OP_PACKET_TRANSFER_REPORT,  sizeof(pb_remote_msg_packet_transfer_report_t),           PB_REMOTE_CLIENT_EVENT_TRANSFER_STATUS_REPORT},
           {PB_REMOTE_OP_PACKET_TRANSFER_STATUS,  sizeof(pb_remote_msg_packet_transfer_status_t),           PB_REMOTE_CLIENT_EVENT_TRANSFER_STATUS}};

    if (PB_REMOTE_OP_PACKET_TRANSFER == p_message->opcode.opcode)
    {
        *p_evt_type = PB_REMOTE_CLIENT_EVENT_PACKET_TRANSFER;
        return (p_message->length > 0 &&
                p_message->length <= PROV_PDU_MAX_LENGTH);
    }

    for (uint32_t i = 0; i < 7; ++i)
    {
        if (p_message->opcode.opcode == message_length_LUT[i].opcode)
        {
            if (message_length_LUT[i].length == p_message->length)
            {
                *p_evt_type = message_length_LUT[i].event_type;
                return true;
            }
            else
            {
                return false;
            }
        }
    }
    /* Could not find the message. */
    return false;
}

static bool is_valid_source(const pb_remote_client_t * p_ctx, const access_message_rx_t * p_message)
{
    dsm_handle_t publish_handle = DSM_HANDLE_INVALID;
    nrf_mesh_address_t publish_address;
    if (access_model_publish_address_get(p_ctx->model_handle, &publish_handle) != NRF_SUCCESS||
        publish_handle == DSM_HANDLE_INVALID ||
        dsm_address_get(publish_handle, &publish_address) != NRF_SUCCESS ||
        publish_address.value != p_message->meta_data.src.value)
    {
        return false;
    }
    else
    {
        return true;
    }
}

static void nack_message(const pb_remote_client_t * p_ctx, const access_message_rx_t * p_message)
{
    access_message_tx_t reply;
    reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;

    switch (p_message->opcode.opcode)
    {
        case PB_REMOTE_OP_PACKET_TRANSFER_REPORT:
        case PB_REMOTE_OP_PACKET_TRANSFER:
        {
            pb_remote_msg_packet_transfer_status_t status;
            status.status = PB_REMOTE_PACKET_TRANSFER_STATUS_REJECTED;
            reply.opcode.opcode = PB_REMOTE_OP_PACKET_TRANSFER_STATUS;
            reply.p_buffer = (const uint8_t*) &status;
            reply.length = sizeof(status);
            send_reply(p_ctx, p_message, &reply);
            break;
        }
        case PB_REMOTE_OP_SCAN_UUID_REPORT:
        {
            pb_remote_msg_scan_status_t status;
            status.status = PB_REMOTE_SCAN_STATUS_REJECTED;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.p_buffer = (const uint8_t*) &status;
            reply.length = sizeof(status);
            send_reply(p_ctx, p_message, &reply);
            break;
        }
        case PB_REMOTE_OP_LINK_STATUS_REPORT:
        {
            pb_remote_msg_link_status_t status;
            status.status = PB_REMOTE_REMOTE_LINK_STATUS_REJECTED;
            status.bearer_type = PB_REMOTE_BEARER_TYPE_PB_ADV;
            reply.opcode.opcode = PB_REMOTE_OP_LINK_STATUS;
            reply.p_buffer = (const uint8_t*) &status;
            reply.length = sizeof(status);
            send_reply(p_ctx, p_message, &reply);
        }

        case PB_REMOTE_OP_SCAN_STATUS:
        case PB_REMOTE_OP_LINK_STATUS:
        case PB_REMOTE_OP_PACKET_TRANSFER_STATUS:
            break;

        default:
            NRF_MESH_ASSERT(false);
            break;
    }
}

static void remote_client_access_rx_cb(access_model_handle_t model_handle,
                                       const access_message_rx_t * p_message,
                                       void * p_args)
{
    pb_remote_client_event_t evt;
    NRF_MESH_ASSERT(p_args != NULL);
    pb_remote_client_t * p_ctx = p_args;

