markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_client.c
    if (!is_valid_message(p_message, &evt.type))
    {
        return;
    }
    else if (!is_valid_source(p_ctx, p_message))
    {
        nack_message(p_ctx, p_message);
    }
    else
    {
        /* TODO: Might be dangerous this. Just call it directly? Copy all the data? */
        evt.evt.p_message = p_message;
        NRF_MESH_ASSERT(fifo_push(&m_pbr_client_event_queue, &evt) == NRF_SUCCESS);
        pb_remote_client_process(p_ctx);
    }
}


/*******************************************************************************
 * Provisioning callbacks
 *******************************************************************************/

static uint32_t pb_if_tx_cb(prov_bearer_t * p_bearer, const uint8_t * p_data, uint16_t length)
{
    if (p_bearer == NULL || p_data == NULL)
    {
        return NRF_ERROR_NULL;
    }

    pb_remote_client_event_t evt;
    evt.type = PB_REMOTE_CLIENT_EVENT_LOCAL_PACKET;
    evt.evt.pb_adv_pdu.length = length;
    memcpy(&evt.evt.pb_adv_pdu.payload[0], p_data, length);

    uint32_t status = fifo_push(&m_pbr_client_event_queue, &evt);
    if (status != NRF_SUCCESS)
    {
        return status;
    }
    pb_remote_client_process(mp_pb_remote_client_model);

    return NRF_SUCCESS;
}


static void pb_if_link_close_cb(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason)
{
    NRF_MESH_ASSERT(p_bearer != NULL);

    pb_remote_client_event_t evt =
        {
            .type = PB_REMOTE_CLIENT_EVENT_LINK_CLOSE,
            .evt.link_close_reason = close_reason
        };

    (void) fifo_push(&m_pbr_client_event_queue, &evt);
    pb_remote_client_process(mp_pb_remote_client_model);
}

/* Unused */

static uint32_t pb_if_link_open_cb(prov_bearer_t * p_bearer, const uint8_t * p_uuid, uint32_t link_timeout_us)
{
    return NRF_SUCCESS;
}

static uint32_t pb_if_listen_start_cb(prov_bearer_t * p_bearer, const char * p_uri, uint16_t oob_info, uint32_t link_timeout_us)
{
    return NRF_SUCCESS;
}

static uint32_t pb_if_listen_stop_cb(prov_bearer_t * p_bearer)
{
    return NRF_SUCCESS;
}

/*******************************************************************************
 * Public API
 *******************************************************************************/

uint32_t pb_remote_client_init(pb_remote_client_t * p_client,
                               uint16_t element_index,
                               nrf_mesh_prov_ctx_t * p_prov_ctx,
                               pb_remote_client_event_cb_t event_cb)
{
    if (p_client == NULL || p_prov_ctx == NULL || event_cb == NULL)
    {
        return NRF_ERROR_NULL;

    }

    p_client->p_prov_ctx = p_prov_ctx;
    p_client->event_cb = event_cb;

    mp_pb_remote_client_model = p_client;

    m_pbr_client_event_queue.array_len  = PB_REMOTE_CLIENT_EVENT_QUEUE_SIZE;
    m_pbr_client_event_queue.elem_array = &m_pbr_client_event_queue_buffer[0];
    m_pbr_client_event_queue.elem_size  = sizeof(pb_remote_client_event_t);
    fifo_init(&m_pbr_client_event_queue);

    /* Setup model */
    access_model_add_params_t init_params;
    init_params.element_index = element_index;
    init_params.model_id.model_id = PB_REMOTE_CLIENT_MODEL_ID;
    init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
    init_params.p_opcode_handlers = &m_opcode_handlers[0];
    init_params.opcode_count = sizeof(m_opcode_handlers)/sizeof(m_opcode_handlers[0]);
    init_params.p_args = p_client;
    init_params.publish_timeout_cb = NULL;

    uint32_t status = access_model_add(&init_params, &p_client->model_handle);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    p_client->reliable.model_handle = p_client->model_handle;
    p_client->reliable.status_cb = client_reliable_status_cb;
    p_client->reliable.timeout = ACCESS_RELIABLE_TIMEOUT_MIN;

    p_client->state = PB_REMOTE_CLIENT_STATE_IDLE;
    m_is_interrupting = false;

    return NRF_SUCCESS;
}

uint32_t pb_remote_client_remote_scan_start(pb_remote_client_t * const p_client)
{
    if (p_client == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if (p_client->state != PB_REMOTE_CLIENT_STATE_IDLE)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    pb_remote_client_event_t evt =
        {
            .type = PB_REMOTE_CLIENT_EVENT_SCAN_START
        };

    uint32_t status = fifo_push(&m_pbr_client_event_queue, &evt);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    pb_remote_client_process(p_client);

    return NRF_SUCCESS;
}

uint32_t pb_remote_client_remote_scan_cancel(pb_remote_client_t * const p_client)
{
    if (!p_client)
    {
        return NRF_ERROR_NULL;
    }

    if (p_client->state != PB_REMOTE_CLIENT_STATE_IDLE)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    pb_remote_client_event_t evt =
        {
            .type = PB_REMOTE_CLIENT_EVENT_SCAN_CANCEL,
        };
    uint32_t status = fifo_push(&m_pbr_client_event_queue, &evt);
    if (status != NRF_SUCCESS)
    {
        return status;
    }
    pb_remote_client_process(p_client);

    return NRF_SUCCESS;
}

uint32_t pb_remote_client_remote_provision(pb_remote_client_t * p_client,
                                           const nrf_mesh_prov_provisioning_data_t * p_prov_data,
                                           const uint8_t * p_public_key,
                                           const uint8_t * p_private_key,
                                           const nrf_mesh_prov_oob_caps_t * p_caps,
                                           uint8_t unprovisioned_device_id)
{
    if (p_client == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if (p_client->state != PB_REMOTE_CLIENT_STATE_IDLE)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    uint32_t status = nrf_mesh_prov_init(p_client->p_prov_ctx,
                                         p_public_key,
                                         p_private_key,
                                         p_caps);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    pb_remote_client_event_t evt =
        {
            .type = PB_REMOTE_CLIENT_EVENT_PROV_START,
            .evt.prov_start.unprov_device_id = unprovisioned_device_id,
            .evt.prov_start.p_prov_data = p_prov_data
        };
    status = fifo_push(&m_pbr_client_event_queue, &evt);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    pb_remote_client_process(p_client);

    return NRF_SUCCESS;
}
